In [2]:
import pandas as pd

In [106]:
d = {
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [129]:
#创建变量r1 = 将df中所有大于3的值乘方，其他值不变
def fun(x):
    if x > 3:
        return x*x
    else:
        return x
r1 = df.applymap(lambda x: fun(x))
r1

   one   two
a  1.0   1.0
b  2.0   2.0
c  3.0   3.0
d  NaN  16.0

In [47]:
r2 = df.query('[1,4] in two')
r2

   one  two
a  1.0  1.0
d  NaN  4.0

In [58]:
r3 = df.sample(axis = 1)

In [59]:
r3

   one
a  1.0
b  2.0
c  3.0
d  NaN

In [63]:
r4 = df['add'] = df.apply(lambda x:x.sum(),axis = 1)

In [65]:
df

   one  two  add
a  1.0  1.0  2.0
b  2.0  2.0  4.0
c  3.0  3.0  6.0
d  NaN  4.0  4.0

In [69]:
r5 = df[(df['one'] > 2)]

In [70]:
r5

   one  two  add
c  3.0  3.0  6.0